Revit 2027 API
View.AddFilter Method
 Adds a filter to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddFilter(
	ElementId filterElementId
)
Public Sub AddFilter (
	filterElementId As ElementId
)
public:
void AddFilter(
	ElementId^ filterElementId
)
member AddFilter :
        filterElementId : ElementId -> unit
Parameters
filterElementId ElementId
 ElementId of the filter.
Exceptions
Exception | Condition
ArgumentException |  ElementId is not associated with a FilterElement. -or- Filter is already applied to the view.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
Remarks
 The filter will be added with default overrides, which means that there will be no change in the view's display. The filter is appended as the last filter in the order of filters applied to this view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace